# Планеты вращаются вокруг звезд по эллиптическим орбитам.
# Назовем самой далекой планетой ту, орбита которой имеет
# самую большую площадь. Напишите функцию
# find_farthest_orbit(list_of_orbits), которая среди списка орбит
# планет найдет ту, по которой вращается самая далекая
# планета. Круговые орбиты не учитывайте: вы знаете, что у
# вашей звезды таких планет нет, зато искусственные спутники
# были были запущены на круговые орбиты. Результатом
# функции должен быть кортеж, содержащий длины полуосей
# эллипса орбиты самой далекой планеты. Каждая орбита
# представляет из себя кортеж из пары чисел - полуосей ее
# эллипса. Площадь эллипса вычисляется по формуле S = pi*a*b,
# где a и b - длины полуосей эллипса. При решении задачи
# используйте списочные выражения. Подсказка: проще всего
# будет найти эллипс в два шага: сначала вычислить самую
# большую площадь эллипса, а затем найти и сам эллипс,
# имеющий такую площадь. Гарантируется, что самая далекая
# планета ровно одна

import math
import random

orbits = [(random.randint(1, 10), random.randint(1, 10)) for i in range(random.randint(5, 10))]
print(orbits)


def find_farthest_orbit(list_of_orbits):
    list_of_orbits = list(filter(lambda v: v[0] != v[1], list_of_orbits))
    summ = ellipse = max_eleps = 0
    for a, b in list_of_orbits:
        summ += a * b * math.pi
        if ellipse < summ:
            ellipse = summ
            max_eleps = (a, b)
        summ = 0

    return max_eleps


print(*find_farthest_orbit(orbits))
